In [25]:
import pandas as pd

In [31]:
df = pd.read_csv("../data/Ecommerce_Sales_Data_2024_2025.csv")

### Top Selling Category ( quantity wise )

In [37]:
query = """
SELECT Category, SUM(Quantity) AS total_quantity
FROM sales
GROUP BY Category
ORDER BY total_quantity DESC
LIMIT 1;
"""

pd.read_sql(query, conn)

    Category  total_quantity
0  Furniture            1591

### Top Selling Category ( sales wise )

In [34]:
query = """
SELECT Category, SUM(Sales) AS total_sales
FROM sales
GROUP BY Category
ORDER BY total_sales DESC
LIMIT 1;
"""

pd.read_sql(query, conn)

     Category  total_sales
0  Home Decor  57233222.35

### Highest Selling Month

In [40]:
query = """
SELECT strftime('%Y-%m', "Order Date") AS year_month, SUM(Sales) AS sales
FROM sales
GROUP BY year_month
ORDER BY sales DESC
LIMIT 1;
"""

pd.read_sql(query, conn)

  year_month        sales
0    2025-05  26010928.65

### City with Highest Profit

In [42]:
query = """
SELECT City, SUM(Profit) AS total_profit
FROM sales
GROUP BY City
ORDER BY total_profit DESC
LIMIT 1;
"""

pd.read_sql(query, conn)

      City  total_profit
0  Lucknow    4523681.09

### Top 3 Cities by Profit

In [44]:
query = """
SELECT City, SUM(Profit) AS total_profit
FROM sales
GROUP BY City
ORDER BY total_profit DESC
LIMIT 3;
"""

pd.read_sql(query, conn)

        City  total_profit
0    Lucknow    4523681.09
1   Guwahati    4487271.28
2  Bangalore    4416914.72